#include "FIRFilter.h"
#include "main.h"
#include "queue.h"
#include "usart.h"
#include "stdio.h"

#define hLength 161
//FIR滤波器参数
const double coefficient = 4.0;
struct queue FIRQueue;
int16_t FIRResult;
int FIRA[hLength];
const double B[161] = {
        -0.0004252435314418,-0.0005884437552072,4.592260926887e-05,-5.480892870666e-05,
  0.0003747042586993,0.0003849094357773,0.0003918838730681,7.987982458523e-05,
  -0.0002634063831323,-0.0005819541887895,-0.0006366709744874,-0.0003939413936649,
  0.0001013590383747,0.0006248538009882,0.0009251257373979,0.0008072935167035,
   0.000266934422098,-0.0004926425627303,-0.001122198103665,-0.001287183139004,
  -0.0008356561064516,9.623444078225e-05, 0.001112666674516,  0.00171958393897,
   0.001559129035007,0.0006069294800719,-0.0007709171176134,-0.001948828370328,
  -0.002319182239659,  -0.0015963634862, 9.53740854194e-07,   0.0017952346232,
   0.002928577598891, 0.002764315760986, 0.001227541267683,-0.001091259226285,
  -0.003148335783179,-0.003906585870602,-0.002845253535614,-0.0002743737105798,
   0.002722565122152, 0.004731242643584, 0.004660615150985, 0.002311765690254,
  -0.001425650563336,-0.004886317619377,-0.006354402419498,-0.004893003941001,
  -0.0008859576890929, 0.004002395886555, 0.007493253134979,  0.00773055859024,
   0.004228342372527,-0.001739434581095,-0.007555761464539, -0.01037269711431,
  -0.008461608069137,-0.002179824883259, 0.005952684275382,  0.01220590661788,
    0.01328700967755, 0.007980701280083,-0.001996477756588, -0.01242806631047,
   -0.01827330967145, -0.01595982344798,-0.005305061287185,  0.00987223764381,
    0.02291040053745,  0.02695333713905,  0.01811403663355,-0.002165184515765,
   -0.02668211538303, -0.04440749604433, -0.04427545747234, -0.01951319253923,
    0.02914547720661,  0.09271082627952,   0.1561343553303,   0.2028317104309,
     0.2199982557081,   0.2028317104309,   0.1561343553303,  0.09271082627952,
    0.02914547720661, -0.01951319253923, -0.04427545747234, -0.04440749604433,
   -0.02668211538303,-0.002165184515765,  0.01811403663355,  0.02695333713905,
    0.02291040053745,  0.00987223764381,-0.005305061287185, -0.01595982344798,
   -0.01827330967145, -0.01242806631047,-0.001996477756588, 0.007980701280083,
    0.01328700967755,  0.01220590661788, 0.005952684275382,-0.002179824883259,
  -0.008461608069137, -0.01037269711431,-0.007555761464539,-0.001739434581095,
   0.004228342372527,  0.00773055859024, 0.007493253134979, 0.004002395886555,
  -0.0008859576890929,-0.004893003941001,-0.006354402419498,-0.004886317619377,
  -0.001425650563336, 0.002311765690254, 0.004660615150985, 0.004731242643584,
   0.002722565122152,-0.0002743737105798,-0.002845253535614,-0.003906585870602,
  -0.003148335783179,-0.001091259226285, 0.001227541267683, 0.002764315760986,
   0.002928577598891,   0.0017952346232, 9.53740854194e-07,  -0.0015963634862,
  -0.002319182239659,-0.001948828370328,-0.0007709171176134,0.0006069294800719,
   0.001559129035007,  0.00171958393897, 0.001112666674516,9.623444078225e-05,
  -0.0008356561064516,-0.001287183139004,-0.001122198103665,-0.0004926425627303,
   0.000266934422098,0.0008072935167035,0.0009251257373979,0.0006248538009882,
  0.0001013590383747,-0.0003939413936649,-0.0006366709744874,-0.0005819541887895,
  -0.0002634063831323,7.987982458523e-05,0.0003918838730681,0.0003849094357773,
  0.0003747042586993,-5.480892870666e-05,4.592260926887e-05,-0.0005884437552072,
  -0.0004252435314418
};
double h[161];

//初始化FIR滤波器参数 完成FIR队列创建工作
void FIRInit(){
    queueInit(& FIRQueue,FIRA,hLength);
    for(int i = 1;i <= hLength;i++){
        queuePush(& FIRQueue,0);
    }
    HAL_Delay(2000);
    for(int j = 0;j < hLength;j++){
        h[j] = B[j] * 65536;
    }
}


int16_t last_data = 0xffff;


void FIRFilter(int16_t in){
    //过滤掉重复的
    if (in == last_data)
        return;
    else
        last_data = in;



    queuePop(&FIRQueue);  //先弹出一个
    queuePush(&FIRQueue,in);  //向其中加入新来的元素
    //queuePrint(&FIRQueue);
    //printf("--------------\n");

    double sum = 0;
    int count = hLength - 1;  //指向h末尾的位置

    //随后遍历整个队列 计算出滤波之后的结果
    int pointer = FIRQueue.front;
    if (FIRQueue.count == 0) {
        return;
    }
    else if (FIRQueue.front <= FIRQueue.rear) {
        while (pointer <= FIRQueue.rear) {
            sum += (FIRQueue.array[pointer] * B[count]);
            count -- ;
            pointer++;
        }
    }
    else {
        for (; pointer <= FIRQueue.maxSize - 1; pointer++) {
            sum += (FIRQueue.array[pointer] * B[count]);
            count -- ;
        }
        for (pointer = 0; pointer <= FIRQueue.rear; pointer++) {
            sum += (FIRQueue.array[pointer] * B[count]);
            count -- ;
        }
    }
    FIRResult = sum * coefficient;

    //printf("%d\r\n", FIRResult);
}

/*
 * @brief 检测心跳
 * @param value 采样数值
 * @return 0 不是心跳 1 是心跳
 */
extern int16_t maxfft;
int heartbeat_check(int value)
{
     int heartbeat_thresh = maxfft/4*2; //心跳下降沿阈值，下降沿高度大于该阈值视为一次心跳
    static int is_init = 0;
    static int up_value = 0;// 波峰数值
    static int down_value = 0;// 波谷数值

    if (!is_init) {
        is_init = 1;
        up_value = value; down_value = value; //首先将当前值视为波峰，波谷
        return 0;
    }
    if (value <= down_value) { //波形正在下降
        down_value = value;
    } else { //波形正在上升，说明检测到波谷
        if ((up_value - down_value) >= heartbeat_thresh) { //检测到心跳
            up_value = value; down_value = value; //将当前值重新时为波峰，波谷，准备下一次检测心跳
            return 1;
        } else {
            up_value = value; down_value = value; //将当前值重新时为波峰，波谷，准备下一次检测心跳
        }
    }
    return 0;
}

/*
 * @brief 计算心跳率
 * @param is_heartbeat 是否是心跳 0 或者 1
 * @return 心跳 个/每分钟
 */
double calc_heartbeat_rate(int is_heartbeat)
{
    static double sampling_rate = 500; //250Hz
    static double heartbeat_rate = 0;
    static double heartbeat_timestamp = 0;

    if (!is_heartbeat) {
        ++heartbeat_timestamp;
        return heartbeat_rate; //直接返回心跳
    }
    heartbeat_rate = 1.0 / heartbeat_timestamp * sampling_rate * 60;
    heartbeat_timestamp = 0;
    return heartbeat_rate;
}
